{
  "backend/main.mo": "Main Internet Computer actor defining all data types (UserProfile, Appointment, Product, Order, Video, Publication, etc.), mutable state maps, and business logic including authorization mixins, blob storage, Stripe integration, and HTTP outcalls for a full-stack studio/e-commerce platform.",
  "feature_evidence.json": "Feature evidence report linking the 'publish draft to production' feature to its supporting files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, covering components like App, Header, Footer, Hero, Biography, Booking, Store, and various hooks and modals.",
  "frontend/BUILD_AND_DRAFT_DEPLOY.md": "Runbook documenting prerequisites and build commands for building the frontend and producing a draft deployment; content is truncated after the prerequisites section.",
  "frontend/index.html": "Minimal HTML entry point setting the page title to 'The Doctor of UDesign (c)sm — Second-2-None Studios' and mounting the React app via /src/main.tsx.",
  "frontend/SMOKE_TEST_CHECKLIST.md": "Manual browser smoke-test checklist for verifying the production deployment at https://drsjc-studios-gdr.caffeine.xyz/, covering version confirmation, landing page render, Internet Identity login, backend connectivity, and static asset loading with pass/fail criteria for each step.",
  "frontend/src/App.tsx": "Root React component that orchestrates authentication state, profile setup, display name gating, members community routing, and payment success/failure screens, wrapping everything in a forced light ThemeProvider.",
  "frontend/src/components/Biography.tsx": "Biography section component rendering Dr. Charbonnet's portrait with metallic gold border and bioluminescent lighting effects, alongside parallax backgrounds and expertise/education/philosophy cards fetched from the backend.",
  "frontend/src/components/Booking.tsx": "Renders a 'Book a Session' section that checks authentication and membership access, showing a PayPal payment link for members or prompting unauthenticated users to log in and subscribe.",
  "frontend/src/components/CartDrawer.tsx": "A slide-out cart drawer component that displays cart items, calculates totals, and initiates a Stripe checkout session when the user proceeds to payment.",
  "frontend/src/components/Contact.tsx": "Displays a contact information card with phone, email, and location fetched from the backend via the useGetContactInfo hook.",
  "frontend/src/components/Credentials.tsx": "Static section displaying Ph.D. and Master's diploma images for Dr. Shane J Charbonnet with styled amber gradient borders.",
  "frontend/src/components/DisplayNameSetupScreen.tsx": "A full-screen form that prompts newly authenticated users to set a display name (max 25 characters) before entering the community portal.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a professional credentials list and a copyright notice linking to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with responsive mobile menu, smooth-scroll nav links, and an Internet Identity login/logout button that adapts based on authentication state.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with parallax mouse-tracking background layers (celestial, geometric, renaissance overlays), a portrait of Dr. Shane J Charbonnet with glow effects, and smooth-scroll CTA buttons.",
  "frontend/src/components/Media.tsx": "Training videos section that gates content behind authentication and membership, showing a lock card with login/subscribe prompts or a PayPal link if the user lacks access.",
  "frontend/src/components/MembersCommunity.tsx": "Members-only community page that renders login, membership-required, or full community content views depending on the user's authentication and membership status.",
  "frontend/src/components/Membership.tsx": "Membership plans section that displays available plans fetched from the backend, shows active-member status, and redirects users to PayPal for subscription checkout.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation screen that informs the user no charges were made and provides buttons to return home or retry the membership checkout.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success screen that invalidates membership/profile queries, confirms the purchase, and lists upcoming access benefits with navigation buttons.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name, email, and optional phone number to create their profile using the `useSaveCallerUserProfile` mutation.",
  "frontend/src/components/Publications.tsx": "Displays a list of Dr. Charbonnet's publications fetched from the API, each with an Amazon buy link, plus a PayPal payment portal button.",
  "frontend/src/components/Store.tsx": "Renders a hardcoded list of apparel items with Bonfire purchase links and QR code images, plus a PayPal payment portal section.",
  "frontend/src/components/StripeSetupModal.tsx": "An admin-only modal dialog for entering and saving Stripe secret key and allowed countries configuration via the `useSetStripeConfiguration` mutation.",
  "frontend/src/components/SupportDonations.tsx": "A static section displaying Venmo and Cash App donation options with QR code images and links for supporting Dr. Charbonnet.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents from the API, rendering each with an external link button and mapping specific document IDs to local PDF assets.",
  "frontend/src/components/VideoModal.tsx": "File appears to be empty with no content provided.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, login status, and helper flags to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for backend interactions including user profiles, display names, biography, store/booking access, products, shopping cart, publications, training content, and Stripe configuration.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS base/components/utilities, defines CSS custom properties for light/dark themes using OKLCH colors, and adds utility classes for glow, metallic, and geometric visual effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/utils/staticAssetUrl.ts": "Utility function that safely constructs URL-encoded static asset paths under the /assets/ prefix, handling absolute URLs, duplicate prefixes, and special characters in filenames.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based design tokens for colors, border radii, box shadows, and custom sidebar/chart palettes, with typography, container queries, and animate plugins enabled.",
  "project_state.json": "Tracks project state for DRSJC Studios GDR, recording schema version, existing features, and configuration for a production deployment to https://drsjc-studios-gdr.caffeine.xyz/."
}