{
  "backend/main.mo": "Main Internet Computer actor defining all data types (UserProfile, Appointment, Product, Order, Video, Publication, etc.), mutable state maps, and business logic including authorization mixins, blob storage, Stripe integration, and HTTP outcalls for a full-stack studio/membership platform.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key UI/logic details of components like App, Header, Footer, Hero, Biography, Booking, Store, and others.",
  "frontend/BUILD_AND_DRAFT_DEPLOY.md": "Runbook documenting prerequisites and build commands for building the frontend and producing a draft deployment using Node.js, pnpm, and DFX CLI.",
  "frontend/index.html": "Minimal HTML entry point setting the page title to 'The Doctor of UDesign (c)sm — Second-2-None Studios' and mounting the React app via /src/main.tsx.",
  "frontend/SMOKE_TEST_CHECKLIST.md": "Manual browser smoke-test checklist for verifying the production deployment at drsjc-studios-gdr.caffeine.xyz, covering version confirmation, landing page render, Internet Identity login, backend connectivity, and static asset loading.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile setup, display name gating, members community routing, and payment success/failure flows, wrapped in a forced light ThemeProvider.",
  "frontend/src/components/Biography.tsx": "Biography section component rendering Dr. Shane JC's portrait with metallic gold border and bioluminescent lighting effects, parallax mouse-tracking background, and expertise cards fetched from the backend biography query.",
  "frontend/src/components/Booking.tsx": "Renders a 'Book a Session' section that checks authentication and membership access, showing a lock card with login/membership prompts for non-members and a PayPal payment link for authorized members.",
  "frontend/src/components/CartDrawer.tsx": "A slide-out cart drawer component that displays cart items, calculates totals, and initiates a Stripe checkout session when the user proceeds to payment.",
  "frontend/src/components/Contact.tsx": "Displays a contact information card with phone, email, and location fetched from the backend via the useGetContactInfo hook.",
  "frontend/src/components/Credentials.tsx": "Static section displaying Ph.D. and Master's diploma images for Dr. Shane J Charbonnet with styled amber gradient presentation.",
  "frontend/src/components/DisplayNameSetupScreen.tsx": "A full-screen form that prompts newly authenticated users to set a display name (max 25 characters) before entering the community portal.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a professional credentials list, copyright notice, and a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with responsive desktop/mobile menus, smooth-scroll section links, and an Internet Identity login/logout button that adapts based on authentication state.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with parallax mouse-tracking background layers (celestial, geometric, renaissance overlays), animated glowing orbs, and a centered portrait with call-to-action buttons that smooth-scroll to other sections.",
  "frontend/src/components/Media.tsx": "Training videos section that checks authentication and video access via hooks, displaying a members-only lock card with login/PayPal/membership prompts if the user lacks access, plus animated background effects.",
  "frontend/src/components/MembersCommunity.tsx": "Members-only community page that gates content behind Internet Identity login and paid membership status, showing appropriate prompts for unauthenticated or non-member users and a full community dashboard for active members.",
  "frontend/src/components/Membership.tsx": "Membership section that fetches and displays subscription plans, shows an active-member banner if already subscribed, and redirects users to a PayPal payment portal to subscribe.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation screen that informs the user no charges were made and provides buttons to return home or retry by scrolling back to the membership section.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success screen that invalidates membership-related React Query caches, displays a confirmation message with a list of unlocked benefits, and offers navigation back home or to the media section.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name, email, and optional phone number, then saves the profile via the `useSaveCallerUserProfile` mutation. It blocks dismissal until the form is successfully submitted.",
  "frontend/src/components/Publications.tsx": "Displays a list of Dr. Charbonnet's publications fetched from the API, each with an Amazon buy link, followed by a PayPal payment portal section with a button and QR code.",
  "frontend/src/components/Store.tsx": "Renders a hardcoded list of three apparel items, each showing a title, an external Bonfire order button, and a QR code image, plus a PayPal payment portal section.",
  "frontend/src/components/StripeSetupModal.tsx": "An admin-only modal dialog for entering a Stripe secret key and allowed countries, which saves the configuration via the `useSetStripeConfiguration` mutation.",
  "frontend/src/components/SupportDonations.tsx": "A static section displaying Venmo and Cash App donation cards with QR code images and links to Dr. Charbonnet's payment profiles.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents from the API, rendering each with a title and external link button, with special-cased static asset URLs for specific document IDs.",
  "frontend/src/components/VideoModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, status flags, and login/clear functions to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, covering user profiles, display names, biography, store/booking access, products, shopping items, publications, training content, and Stripe configuration.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS layers, defines CSS custom properties for light/dark themes using OKLCH colors, and adds utility classes for glow, metallic, and geometric visual effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/utils/staticAssetUrl.ts": "Utility function that safely constructs URL-encoded static asset paths under the /assets/ prefix, handling absolute URLs, duplicate prefixes, and special characters in filenames.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with OKLCH-based CSS variable color tokens, custom border radii, box shadows, and enables the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state for the 'Simply Shane Designs' personal portfolio site, including a pending feature request (AR-1) to update the hero block's second line from 'Dr. Shane J Charbonnet' to 'Dr. Shane JC'. Also notes a known production deployment failure issue."
}