{
  "backend/main.mo": "Main Internet Computer actor defining all data types (UserProfile, Appointment, Product, Order, Video, Publication, etc.), mutable state maps, and business logic including authorization mixins, blob storage, Stripe integration, and HTTP outcalls for a full-stack wellness/consulting platform.",
  "feature_evidence.json": "Feature evidence report linking the 'publish draft build version 106 to production' feature to its supporting file (BUILD_AND_DRAFT_DEPLOY.md) and component dependencies with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one- to two-sentence summaries of each frontend source file, describing the purpose and key UI/logic details of components, hooks, and pages in the React application.",
  "frontend/BUILD_AND_DRAFT_DEPLOY.md": "Runbook documenting prerequisites and build commands for installing dependencies and producing a draft deployment of the frontend for review.",
  "frontend/index.html": "Minimal HTML entry point that sets the page title to 'The Doctor of UDesign (c)sm — Second-2-None Studios' and mounts the React app via /src/main.tsx.",
  "frontend/SMOKE_TEST_CHECKLIST.md": "Manual browser smoke-test checklist covering landing page render and Internet Identity login initiation, with pass/fail criteria, quick-reference table, and troubleshooting tips for verifying a deployed draft build.",
  "frontend/src/App.tsx": "Root React component that orchestrates authentication state, profile setup modals, display name gating, members-community routing, and payment success/failure screens, all wrapped in a forced light ThemeProvider.",
  "frontend/src/components/Biography.tsx": "Biography section component rendering Dr. Charbonnet's portrait with metallic gold border and bioluminescent lighting effects, parallax background layers, and expertise/education/philosophy cards fetched from the backend.",
  "frontend/src/components/Booking.tsx": "Renders a 'Book a Session' section that checks authentication and membership access, showing a PayPal payment link for members or prompting unauthenticated users to log in and subscribe.",
  "frontend/src/components/CartDrawer.tsx": "A slide-out cart drawer component that displays cart items, calculates totals, and initiates a Stripe checkout session when the user proceeds to payment.",
  "frontend/src/components/Contact.tsx": "Displays a contact information card with phone, email, and location fetched from the backend via the useGetContactInfo hook.",
  "frontend/src/components/Credentials.tsx": "Static section displaying Ph.D. and Master's diploma images for Dr. Shane J Charbonnet with styled amber gradient visuals.",
  "frontend/src/components/DisplayNameSetupScreen.tsx": "A full-screen form that prompts a newly authenticated user to set a display name (max 25 characters) before entering the community portal.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a professional credentials section listing degrees and certifications, plus a copyright notice with a caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Fixed navigation header with responsive desktop/mobile menus, smooth-scroll section links, and an Internet Identity login/logout button that clears the React Query cache on logout.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with a parallax mouse-tracking background using layered images, glowing orbs, and a centered portrait of Dr. Shane J Charbonnet with call-to-action buttons.",
  "frontend/src/components/Media.tsx": "Training videos section that gates content behind authentication and membership, showing a lock card with login/subscribe prompts or a PayPal link if the user lacks access.",
  "frontend/src/components/MembersCommunity.tsx": "Members-only community page that conditionally renders login, membership-required, or full community content cards based on the user's authentication and membership status.",
  "frontend/src/components/Membership.tsx": "Membership plans section that fetches and displays available plans, shows active-member status, and redirects users to PayPal for subscription checkout.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation screen that informs the user no charges were made and provides buttons to return home or retry the membership checkout.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success screen that invalidates membership-related queries, confirms the purchase, and lists upcoming access benefits with navigation buttons.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name, email, and optional phone number to create their profile using the `useSaveCallerUserProfile` mutation.",
  "frontend/src/components/Publications.tsx": "Displays a list of Dr. Charbonnet's publications fetched from the API, each with an Amazon buy link, plus a PayPal payment portal section.",
  "frontend/src/components/Store.tsx": "Renders a hardcoded list of apparel items (from Bonfire) with order buttons and QR code images, plus a PayPal payment portal section.",
  "frontend/src/components/StripeSetupModal.tsx": "An admin-only modal dialog for entering and saving Stripe secret key and allowed countries configuration via the `useSetStripeConfiguration` mutation.",
  "frontend/src/components/SupportDonations.tsx": "A static section displaying Venmo and Cash App donation cards with QR code images and links for supporting Dr. Charbonnet.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents from the API, rendering each with an external link button and a PayPal portal, with special-cased PDF URL mappings for specific document IDs.",
  "frontend/src/components/VideoModal.tsx": "File is empty with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, status flags, and login/clear functions to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, covering user profiles, display names, biography, appointments, store access, products, shopping items, publications, training content, and Stripe configuration.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS layers, defines CSS custom properties for light/dark themes using OKLCH colors, and adds utility classes for glow, metallic, and geometric visual effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/utils/staticAssetUrl.ts": "Utility function that safely constructs URL-encoded static asset paths under the /assets/ prefix, handling absolute URLs, duplicate prefixes, and special characters in filenames.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback for sensitive values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that extends the theme with OKLCH-based design tokens for colors, border radii, box shadows, and custom sidebar/chart palettes, and enables typography, container queries, and animation plugins.",
  "project_state.json": "Tracks project state for 'Second-2-None Studios' at version 3, recording one existing feature related to publishing a draft build to production with no new feature requests or known issues."
}