{
  "backend/main.mo": "Main backend actor defining data types (UserProfile, Appointment, Product, Order, Video, Publication, etc.), mutable state maps for storing entities, and helper functions including membership access checks and Stripe integration.",
  "feature_evidence.json": "Feature evidence report documenting a single feature to update Biography component text from 'Dr. Shane J Charbonnet' to 'The Doctor of UDesign ©sm', with high confidence and test ID REQ-1.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including App.tsx (authentication and routing), hooks (React Query for backend calls), Header/Footer (navigation and credentials), Hero/Biography (portrait displays with visual effects), and various feature sections (Booking, Store, Media, etc.).",
  "frontend/BUILD_AND_DRAFT_DEPLOY.md": "Runbook providing prerequisites and build commands for building the frontend and producing a draft deployment for review.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title, root div, and module script loading main.tsx.",
  "frontend/SMOKE_TEST_CHECKLIST.md": "Manual browser smoke test checklist with two main tests: verifying landing page render (header, hero, footer) and Internet Identity login initiation, including pass/fail criteria and troubleshooting guidance.",
  "frontend/src/App.tsx": "Main application component managing authentication state, profile setup flow, display name setup for paid members, members community routing, payment success/failure handling, and public site sections with forced light theme.",
  "frontend/src/components/Biography.tsx": "Biography section component displaying Dr. Charbonnet's graduation portrait with metallic gold shimmer border and bioluminescent lighting effects, featuring parallax backgrounds, updated typography layout with 'Simply Shane Designs (c)sm' and 'The Doctor of UDesign (c)sm' heading, and expertise cards with expanded education section.",
  "frontend/src/components/Booking.tsx": "Displays a booking section for one-on-one consulting sessions at $515/hour, requiring authentication and membership access. Shows loading state, membership gate with PayPal payment option, and scrolls to membership section when needed.",
  "frontend/src/components/CartDrawer.tsx": "Implements a shopping cart drawer with item management (add/remove/clear) and Stripe checkout integration. Handles checkout session creation and redirects to Stripe payment page with success/cancel URLs.",
  "frontend/src/components/Contact.tsx": "Renders a contact information section displaying phone, email, and location details fetched from backend. Uses card layout with icons for each contact method.",
  "frontend/src/components/Credentials.tsx": "Displays professional credentials section with images of Ph.D. and Master's diplomas in styled cards with gradient effects and hover animations.",
  "frontend/src/components/DisplayNameSetupScreen.tsx": "Provides a full-screen modal for users to set their display name (max 25 characters) on first login. Validates input and calls backend mutation before allowing access to member portal.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty component file with no content.",
  "frontend/src/components/Footer.tsx": "Renders site footer with detailed professional credentials section listing degrees, certifications, and expertise, plus copyright notice with caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Implements sticky header with navigation menu, Internet Identity authentication button, and smooth scrolling to page sections. Supports both main site and community navigation modes with mobile responsive menu.",
  "frontend/src/components/Hero.tsx": "Hero section component with parallax mouse-tracking effects, layered background images (celestial, geometric, renaissance), glowing orbs, and a centered portrait with neural glow effects. Includes CTA buttons to scroll to other sections.",
  "frontend/src/components/Media.tsx": "Media section component that displays training videos behind authentication and membership checks. Shows locked state with login/subscribe prompts, or loading spinner while checking access.",
  "frontend/src/components/MembersCommunity.tsx": "Members-only community page that gates access based on authentication and membership status. Shows login prompt, membership requirement card, or full community access with icons for various content types.",
  "frontend/src/components/Membership.tsx": "Membership plans section that displays subscription tiers with features, pricing, and PayPal payment integration. Shows active member status if already subscribed and includes Stripe setup modal.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation confirmation page with destructive-themed styling, explaining no charges were made and offering buttons to return home or retry membership purchase.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success confirmation page that invalidates membership queries to refresh user status, displays success message with membership benefits list, and provides navigation buttons to home or content sections.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to set up their profile with name, email, and optional phone number. Uses form validation and saves profile data via useSaveCallerUserProfile hook.",
  "frontend/src/components/Publications.tsx": "Displays a list of Dr. Charbonnet's publications with Amazon purchase links and includes a PayPal payment portal section. Features celestial-themed background styling and loading states.",
  "frontend/src/components/Store.tsx": "Displays hardcoded apparel items with Bonfire purchase links and QR codes in a three-line format (title, order button, QR code). Uses celestial-themed background styling matching other sections.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe payment settings including secret key and allowed countries. Only visible to admin users and saves configuration via useSetStripeConfiguration hook.",
  "frontend/src/components/SupportDonations.tsx": "Displays Venmo and Cash App payment options with QR code images in a two-column grid layout. Features hover effects and decorative corner accents with celestial background styling.",
  "frontend/src/components/TrainingVideos.tsx": "Displays training videos and documents with external links, including special handling for specific document IDs to map to static PDF assets. Includes PayPal portal and uses celestial-themed background.",
  "frontend/src/components/VideoModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flows, identity persistence via AuthClient, and delegation validation with configurable idle and identity provider options.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching and mutating backend data including user profiles, display names, biography, appointments, store access, apparel items, publications, products, shopping items, Stripe configuration, and training materials.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, utility classes for glow effects, metallic borders, bioluminescent shadows, and geometric overlays using CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider context, then renders the root App component.",
  "frontend/src/utils/staticAssetUrl.ts": "Provides a utility function to safely construct URL-encoded asset paths with /assets/ prefix, handling spaces, special characters, and avoiding duplication for already-prefixed or absolute URLs.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routes, persisting them in sessionStorage, and clearing sensitive parameters from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color system, container settings, border radius variables, and custom shadow utilities including glow effects.",
  "project_state.json": "Project state tracking a request to update Biography component line-2 text from 'Dr. Shane J Charbonnet' to 'The Doctor of UDesign ©sm'. Contains one existing feature and one pending feature request (AR-1) for this text change."
}