{
  "backend/main.mo": "Defines the backend canister with authorization, storage mixins, data types, and mutable maps for users, products, orders, media, publications, and appointments.",
  "feature_evidence.json": "Feature evidence report listing two features related to removing a Hero background image and deleting a static asset file, including associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing UI components, styling, media sections, hooks, and store logic across the React app.",
  "frontend/index.html": "Basic HTML entry point containing the root div and script loading the React application.",
  "frontend/src/App.tsx": "Main React app component managing authentication, profile setup, payment status routing, and rendering all primary site sections.",
  "frontend/src/components/Biography.tsx": "Biography section with parallax backgrounds, portrait display, dynamic mouse‑based parallax effects, and biography content fetched from the backend.",
  "frontend/src/components/Booking.tsx": "Booking section enforcing member‑only access, displaying the consulting rate, and offering PayPal link and login/membership prompts.",
  "frontend/src/components/CartDrawer.tsx": "Shopping cart drawer with item listing, total calculation, Stripe checkout, and cart management actions.",
  "frontend/src/components/Contact.tsx": "Displays contact info using fetched data with icons for phone, email, and location.",
  "frontend/src/components/Credentials.tsx": "Shows credential section with styled images of Ph.D. and Master's diplomas.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty placeholder component.",
  "frontend/src/components/Footer.tsx": "Footer containing detailed professional credentials and a copyright notice.",
  "frontend/src/components/Header.tsx": "Site header with scroll‑aware styling, navigation links, and authentication handling.",
  "frontend/src/components/Hero.tsx": "Animated hero section with parallax backgrounds and central portrait reacting to mouse movement.",
  "frontend/src/components/Media.tsx": "Media section displaying training videos with membership gating and animated visual effects.",
  "frontend/src/components/Membership.tsx": "Renders the membership section, loading states, plan listings, and PayPal-based subscription handling with user membership checks.",
  "frontend/src/components/PaymentFailure.tsx": "Displays a payment-cancelled message with options to return home or retry, including smooth scroll back to the membership section.",
  "frontend/src/components/PaymentSuccess.tsx": "Shows a payment-success screen, invalidates membership-related queries, and offers navigation to home or the media section.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects and submits user profile details, validating fields and saving the profile via a mutation.",
  "frontend/src/components/Publications.tsx": "Fetches and displays a list of publications with Amazon links and includes a PayPal payment portal section.",
  "frontend/src/components/Store.tsx": "Shows a list of hardcoded apparel items with purchase links and QR codes, styled within a themed section.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal allowing entry and saving of Stripe secret key and allowed countries via mutation.",
  "frontend/src/components/SupportDonations.tsx": "Static section displaying Venmo and Cash App donation cards with styled backgrounds and links.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents with loading states and PayPal link.",
  "frontend/src/components/VideoModal.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, reinitializing access control and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for managing Internet Identity authentication, login flow, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping various backend actor calls for profiles, content, store access, and training materials.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, dark mode variants, and custom utility classes for glow, shadows, and decorative effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/utils/staticAssetUrl.ts": "Provides a helper to build URL-encoded asset paths, handling absolute URLs and existing /assets/ prefixes.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, feature requests, and current state for the hero image removal task."
}