{
  "backend/main.mo": "Primary backend actor defining authorization mixins, storage, various data types, and mutable state maps for users, appointments, products, orders, media, and publications.",
  "backend/migration.mo": "Migration module mapping old actor state to the new structure, defining legacy types and returning the original state without modification.",
  "feature_evidence.json": "Feature evidence report linking a training document PDF-link fix to the relevant frontend file and components with high confidence.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to descriptive summaries of their UI roles and behavior.",
  "frontend/index.html": "Base HTML file mounting the React app via root div and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, payment status routing, layout structure, and conditional profile setup modal.",
  "frontend/src/components/Biography.tsx": "Biography section component fetching biography content and rendering an animated parallax visual layout with portrait and styled text.",
  "frontend/src/components/Booking.tsx": "Renders the booking section with consulting rate info, membership-gated access, and login or membership navigation controls.",
  "frontend/src/components/CartDrawer.tsx": "Implements a slide-out shopping cart with item display, total calculation, and Stripe checkout session creation.",
  "frontend/src/components/Contact.tsx": "Displays contact information fetched from the backend including phone, email, and location.",
  "frontend/src/components/Credentials.tsx": "Shows credential-related images such as diplomas and a portrait with styled presentation.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty component file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Provides footer content with professional credentials list and a copyright notice.",
  "frontend/src/components/Header.tsx": "Defines the main site header with navigation links, scroll behavior, and Internet Identity login/logout handling.",
  "frontend/src/components/Hero.tsx": "Hero section with layered parallax backgrounds reacting to mouse movement and a smooth scroll helper.",
  "frontend/src/components/Media.tsx": "Media section showing training videos with access control, authentication checks, and parallax effects.",
  "frontend/src/components/Membership.tsx": "Displays membership plans, user membership status, and subscription flow with PayPal redirect.",
  "frontend/src/components/PaymentFailure.tsx": "Full‑screen payment failure message with navigation options back to home or membership retry.",
  "frontend/src/components/PaymentSuccess.tsx": "Full‑screen payment success message that refreshes membership data and offers navigation links.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for collecting and saving a user’s basic profile information with validation and API submission.",
  "frontend/src/components/Publications.tsx": "Renders a publications section that fetches books, displays purchase links, and includes a PayPal payment portal.",
  "frontend/src/components/Store.tsx": "Displays a list of hardcoded apparel items with order links and QR codes in a styled merchandise section.",
  "frontend/src/components/StripeSetupModal.tsx": "Provides an admin‑only modal for entering and saving Stripe secret key and allowed countries via a mutation.",
  "frontend/src/components/SupportDonations.tsx": "Shows donation options with styled Venmo and Cash App cards including QR codes and links.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents, offering external watch/download links and a PayPal section.",
  "frontend/src/components/VideoModal.tsx": "File is empty or contains no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login flow, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, content, access checks, and various backend resources via the actor API.",
  "frontend/src/index.css": "Sets up global Tailwind base styles, theme variables, dark mode values, and custom utility classes for glow, shadows, and visual effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/staticAssetUrl.ts": "Builds safe URL-encoded paths for static assets under /assets/, handling special characters and absolute URLs.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, supporting both querystring and hash routing with sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, containers, shadows, and plugins including typography, container queries, and animations.",
  "project_state.json": "Describes project state, including tasks to fix Training Document #3 PDF linking and remove a leading space in the INTRO paragraph."
}