{
  "backend/main.mo": "Defines the main canister actor with authorization, blob storage, state maps for profiles, appointments, products, orders, media, and publications, plus related data types and counters.",
  "feature_evidence.json": "Lists feature evidence entries describing UI‑theme changes, affected files, components, and test IDs with high‑confidence metadata.",
  "frontend-file-summaries.txt": "Contains short textual summaries of many frontend React components, describing their functionality, visuals, and structural roles.",
  "frontend/index.html": "Base HTML entry file that loads the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Main React app component handling authentication, forced light theme, payment success/failure routing, and rendering all major site sections.",
  "frontend/src/components/Biography.tsx": "Biography section with parallax effects, glowing portrait presentation, dynamic overlays, and biography content loading.",
  "frontend/src/components/Booking.tsx": "Booking section enforcing member‑only access, showing consulting rate, login prompts, and membership navigation with visual effects.",
  "frontend/src/components/CartDrawer.tsx": "Implements a sliding shopping cart drawer with item display, cart management, and Stripe checkout session creation.",
  "frontend/src/components/Contact.tsx": "Displays contact information fetched from the backend using styled cards with phone, email, and location details.",
  "frontend/src/components/Credentials.tsx": "Renders a credentials section showing diploma and portrait images with decorative styling.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty component file with no implementation.",
  "frontend/src/components/Footer.tsx": "Provides a footer containing professional credentials text and a copyright notice with branding.",
  "frontend/src/components/Header.tsx": "Defines a responsive header with navigation, scroll effects, and Internet Identity login/logout handling.",
  "frontend/src/components/Hero.tsx": "Creates a hero section with layered parallax backgrounds and interactive mouse‑based motion effects.",
  "frontend/src/components/Media.tsx": "Displays training videos section, checks user access and authentication, and shows gated content with animated visuals.",
  "frontend/src/components/Membership.tsx": "Renders membership plans, checks membership and Stripe setup status, and provides subscription actions.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a payment cancellation screen with options to return home or retry by scrolling to membership.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays payment success, refreshes membership data, and provides navigation to home or content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, email, and optional phone, submitting via a saveProfile mutation.",
  "frontend/src/components/Publications.tsx": "Fetches and lists publications with Amazon links and includes a PayPal payment portal section.",
  "frontend/src/components/Store.tsx": "Displays a list of hardcoded apparel items with order buttons and QR codes in a styled section.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe by submitting a secret key and allowed countries.",
  "frontend/src/components/SupportDonations.tsx": "Renders donation options including Venmo and Cash App with styled cards and QR images.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents with loading states and external watch links.",
  "frontend/src/components/VideoModal.tsx": "Empty placeholder file for a video modal component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and mutate user profile data, content sections, access permissions, and media from the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, OKLCH theme variables, dark mode styles, and custom glow/visual effect utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/utils/staticAssetUrl.ts": "Generates URL‑encoded asset paths by encoding each filename segment under the /assets/ prefix.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, with support for hash-based routing and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, radii, and plugins while enabling class-based dark mode and custom design tokens.",
  "project_state.json": "Captures the project's current architecture, features, issues, and deployment constraints for the ICP-backed React application."
}