{
  "backend/main.mo": "Actor defining authorization mixins, storage, and multiple data types with mutable maps for users, products, orders, media, and other site content.",
  "feature_evidence.json": "Feature evidence report specifying a frontend change in Hero.tsx and associated metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and design details of all major frontend components.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling identity, payment status routing, profile setup, and rendering all site sections.",
  "frontend/src/components/Biography.tsx": "Biography section fetching bio data and rendering a styled portrait, animated background, and descriptive content.",
  "frontend/src/components/Booking.tsx": "Booking page checking membership access, showing consulting rate, and providing login or membership prompts with styled UI.",
  "frontend/src/components/CartDrawer.tsx": "Shopping cart drawer component handling item display, cart clearing, and Stripe checkout session creation.",
  "frontend/src/components/Contact.tsx": "Displays contact information fetched from the backend with styled phone, email, and location sections.",
  "frontend/src/components/Credentials.tsx": "Renders a credentials section with diploma and portrait images in a styled layout.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/Footer.tsx": "Footer displaying detailed professional credentials and a copyright notice.",
  "frontend/src/components/Header.tsx": "Fixed header with navigation links, scroll handling, mobile menu, and Internet Identity login/logout.",
  "frontend/src/components/Hero.tsx": "Interactive hero section with parallax background layers and mouse‑tracking visual effects.",
  "frontend/src/components/Media.tsx": "Displays the training videos section, checks user access, and shows locked content prompts with login and membership options.",
  "frontend/src/components/Membership.tsx": "Shows membership plans, user membership status, and handles PayPal-based subscription actions.",
  "frontend/src/components/PaymentFailure.tsx": "Renders a payment cancellation screen with options to return home or retry navigating to membership.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays a successful payment confirmation, refreshes membership data, and offers navigation to content or home.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a user profile with name, email, and phone fields, saving data via a mutation.",
  "frontend/src/components/Publications.tsx": "Fetches and displays a list of publications with Amazon links and provides a PayPal payment portal link.",
  "frontend/src/components/Store.tsx": "Displays a list of hardcoded apparel items with order links and QR codes inside a styled section.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for submitting and saving Stripe secret key and allowed countries.",
  "frontend/src/components/SupportDonations.tsx": "Renders donation options with Venmo and Cash App cards including QR images and links.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents with loading states and external watch links.",
  "frontend/src/components/VideoModal.tsx": "Empty file with no implemented content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile data, content, access flags, and various backend resources via an actor.",
  "frontend/src/index.css": "Configures global Tailwind layers, color variables, dark mode values, and custom utility classes for visual effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/staticAssetUrl.ts": "Provides a helper that URL-encodes filename segments and returns a safe /assets/ URL path.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and modifying hash-based query params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, and enabling plugins like typography and animations.",
  "project_state.json": "Tracks project metadata, versions, and feature requests related to frontend whitespace and audio player adjustments."
}