{
  "backend/main.mo": "Motoko canister defining authorization mixins, blob storage, and data models for users, appointments, products, orders, media, and publications with associated mutable state and ID counters.",
  "feature_evidence.json": "Feature evidence report listing two homepage audio‑player features, their associated frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing roles and UI details of various frontend components across the application.",
  "frontend/index.html": "Basic HTML entry file that mounts the React app and loads main.tsx as the module entrypoint.",
  "frontend/src/App.tsx": "Main React application component handling authentication, payment status routing, profile setup, and rendering all major site sections with theming and global UI providers.",
  "frontend/src/components/Biography.tsx": "Biography section fetching bio content and rendering animated parallax visuals, styled portrait, and detailed biography layout.",
  "frontend/src/components/Booking.tsx": "Booking section showing consulting rate, membership‑gated access logic, and links to PayPal and membership options with animated background effects.",
  "frontend/src/components/CartDrawer.tsx": "Drawer UI for viewing and managing cart items and initiating Stripe checkout sessions.",
  "frontend/src/components/Contact.tsx": "Displays contact information pulled from backend queries with styled icons and layout.",
  "frontend/src/components/Credentials.tsx": "Shows diploma and portrait images with decorative styling in a credentials section.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty placeholder component file.",
  "frontend/src/components/Footer.tsx": "Renders footer with professional credentials list and copyright notice.",
  "frontend/src/components/Header.tsx": "Navigation header with scroll effects, section scrolling, mobile menu, and Internet Identity login logic.",
  "frontend/src/components/Hero.tsx": "Hero section with layered parallax backgrounds, cursor‑based movement, and scroll‑to‑section button.",
  "frontend/src/components/Media.tsx": "Renders the Training Videos section, checks user authentication and video access, and displays gated content with animated visuals.",
  "frontend/src/components/Membership.tsx": "Displays membership plans, user membership status, and PayPal subscription flow with decorative UI effects.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a payment cancellation message with options to return home or retry by scrolling to the membership section.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays a success message after payment, refreshes membership data, and provides navigation options.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating a basic user profile with form validation and submission via a saveProfile mutation.",
  "frontend/src/components/Publications.tsx": "Fetches and displays a list of publications with Amazon links and includes a PayPal payment portal section.",
  "frontend/src/components/Store.tsx": "Displays a list of hardcoded apparel items with Bonfire purchase links and QR codes in a styled section.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe by submitting a secret key and allowed countries.",
  "frontend/src/components/SupportDonations.tsx": "Renders a styled donations section featuring Venmo and Cash App cards with QR images and links.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents with loading states and external watch links.",
  "frontend/src/components/VideoModal.tsx": "Empty placeholder file for a video modal component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks that call actor methods to fetch or mutate user profile, content, access checks, and media lists.",
  "frontend/src/index.css": "Tailwind base styles plus extensive custom OKLCH variables and glow/metallic utility classes.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps the app with Internet Identity context.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors with OKLCH tokens and enabling typography, container queries, and animations.",
  "project_state.json": "Project state metadata describing the ICP-backed React site, architecture notes, and known issues."
}