{
  "backend/main.mo": "Motoko canister defining core backend state and APIs for users, appointments, products, orders, media, publications, training content, and payments, with authorization, blob storage, Stripe integration, and membership-based access control. Manages IDs, persistent maps, and business logic for a full content, commerce, and booking platform.",
  "feature_evidence.json": "Feature evidence report documenting a frontend UI change that adds a neon lime green \"Site Soundtrack.\" label above YouTube Music links in the Hero component, with referenced files, dependencies, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend files and components, describing UI sections, hooks, design updates, and recent feature additions across the React application.",
  "frontend/index.html": "HTML entry point for the React frontend that defines the root mount node and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Top-level React application component that wires authentication, theme provider, payment success/failure routing, profile setup flow, and renders all main site sections and layout components.",
  "frontend/src/components/Biography.tsx": "Biography section component that fetches and displays profile content with rich visual effects, parallax mouse movement, animated backgrounds, and a styled portrait presentation.",
  "frontend/src/components/Booking.tsx": "Booking section that displays consulting rates and enforces member-only access, handling authentication prompts, membership navigation, and PayPal payment links with themed UI styling.",
  "frontend/src/components/CartDrawer.tsx": "Implements a sliding shopping cart drawer UI with item listing, removal, and total calculation, and initiates a Stripe checkout session with validation and error handling.",
  "frontend/src/components/Contact.tsx": "Renders a contact section displaying phone, email, and location fetched from the backend using a query hook.",
  "frontend/src/components/Credentials.tsx": "Displays a credentials section with styled images for Ph.D. and Master’s diplomas and a portrait, focused purely on presentation.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/Footer.tsx": "Defines the site footer containing an extensive professional credentials list and a copyright notice with branding.",
  "frontend/src/components/Header.tsx": "Provides a fixed responsive header with navigation links, scroll behavior, and Internet Identity–based authentication controls.",
  "frontend/src/components/Hero.tsx": "Implements the hero section with layered parallax backgrounds, animated visual effects, and call-to-action scrolling to page sections.",
  "frontend/src/components/Media.tsx": "Renders the Training Videos section with animated visuals and access gating based on authentication and membership status, showing a loader while access is checked. Integrates Internet Identity login, membership prompts, and links to PayPal for subscription.",
  "frontend/src/components/Membership.tsx": "Displays membership plans, benefits, and current membership status, loading plans from queries and handling authenticated vs non-authenticated users. Provides PayPal-based subscription flow and conditional UI for active members.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a full-screen payment cancelled state with messaging, background effects, and actions to return home or retry membership purchase. Includes smooth scrolling back to the membership section.",
  "frontend/src/components/PaymentSuccess.tsx": "Shows a full-screen payment success confirmation, invalidates membership-related queries, and outlines unlocked benefits. Provides actions to return home or scroll to media content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that forces new users to create a basic profile with name, email, and optional phone. Submits profile data via a mutation and shows success or error toasts.",
  "frontend/src/components/Publications.tsx": "Renders a publications section listing books fetched from the backend with links to Amazon purchases. Includes themed visuals, loading state, and a PayPal payment portal for direct payments.",
  "frontend/src/components/Store.tsx": "Renders an Apparel store section with hardcoded merchandise items, each showing a title, external Bonfire order link, and optional QR code image, styled with layered gradient backgrounds.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal dialog that lets administrators configure Stripe by entering a secret key and allowed countries, saving the configuration via backend mutation with validation and toast feedback.",
  "frontend/src/components/SupportDonations.tsx": "Displays a Support & Donations section with styled cards linking to Venmo and Cash App, including QR code images and decorative hover effects.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents from backend hooks, showing loading states, empty states, and external links to watch videos, within a styled section.",
  "frontend/src/components/VideoModal.tsx": "File is present but contains no implementation or exports.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor based on the current Internet Identity, initializes admin access if available, and invalidates dependent React Query caches when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including login, logout, persisted identity loading, and detailed login status handling using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a collection of TanStack React Query hooks that wrap backend canister actor calls for fetching and mutating user profiles, access checks, and content like apparel, publications, and training media. Hooks coordinate with useActor for availability, enablement, caching, and query invalidation.",
  "frontend/src/index.css": "Global Tailwind CSS entry defining extensive OKLCH-based design tokens, dark-mode variables, and base styles. Includes custom utility classes for glow effects, metallic gradients, shadows, and animated text.",
  "frontend/src/main.tsx": "Application entry point that creates the React root and wraps the App with React Query and Internet Identity providers. Initializes a shared QueryClient and imports global styles.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from query strings or hash-based routes and persisting them in sessionStorage. Supports retrieval, storage, clearing, and safe removal of sensitive hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, content scanning, plugins, and container defaults. Extends the theme with OKLCH color tokens, border radii, shadows, and design-system mappings tied to CSS variables.",
  "project_state.json": "Machine-readable snapshot of the project’s current architecture, features, and versions, describing an ICP canister-backed React/Tailwind SPA with Internet Identity auth, membership gating, Stripe payments, and admin tooling. Serves as a high-level source of truth for planning and change tracking."
}