{
  "backend/main.mo": "Defines core actor logic with authorization, blob storage mixins, and various data types and state maps for users, products, orders, media, publications, and training materials.",
  "feature_evidence.json": "Feature evidence report documenting a frontend change to make Training Document #2 open its PDF in a new tab, including affected file and component metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing their purpose, UI behavior, and design changes across the app.",
  "frontend/index.html": "Root HTML file loading the React application by mounting the root div and importing main.tsx.",
  "frontend/src/App.tsx": "Main application component handling identity, profile setup, payment status routing, and rendering all major sections under a forced light theme.",
  "frontend/src/components/Biography.tsx": "Biography section fetching dynamic content and rendering a portrait with animated parallax, lighting effects, and styled textual biography details.",
  "frontend/src/components/Booking.tsx": "Booking section showing consulting rate info and membership-gated session booking with login prompts and themed visual effects.",
  "frontend/src/components/CartDrawer.tsx": "Implements a slide-out shopping cart with item listing, removal, total calculation, and Stripe checkout handling.",
  "frontend/src/components/Contact.tsx": "Displays contact information fetched from the backend with phone, email, and location details.",
  "frontend/src/components/Credentials.tsx": "Renders a credentials section showcasing Ph.D. and Master's diploma images with styled layout.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty file with no implementation.",
  "frontend/src/components/Footer.tsx": "Shows a footer containing detailed professional credentials and a copyright notice.",
  "frontend/src/components/Header.tsx": "Provides a responsive header with navigation, scroll behavior, and Internet Identity login/logout integration.",
  "frontend/src/components/Hero.tsx": "Creates a dynamic hero section with parallax background effects and central portrait content.",
  "frontend/src/components/Media.tsx": "Displays a training videos section with membership-gated access, authentication checks, and visual effects.",
  "frontend/src/components/Membership.tsx": "Displays membership plans, handles authentication status, PayPal subscription redirection, and shows premium access features and member state.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a payment cancellation message with options to return home or scroll back to the membership section.",
  "frontend/src/components/PaymentSuccess.tsx": "Displays a successful payment confirmation, refreshes membership data, and provides navigation to home or content sections.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal for creating a basic user profile with name, email, and optional phone, submitting via a profile-saving API mutation.",
  "frontend/src/components/Publications.tsx": "Fetches and displays a list of publications with Amazon links and includes a PayPal payment section.",
  "frontend/src/components/Store.tsx": "Shows a list of apparel items with purchase links and QR codes, linking to Bonfire product pages.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal to enter and save Stripe secret key and allowed countries using a mutation.",
  "frontend/src/components/SupportDonations.tsx": "Static section displaying Venmo and Cash App donation cards with styled backgrounds and links.",
  "frontend/src/components/TrainingVideos.tsx": "Fetches and displays training videos and documents, offering external links and a PayPal donation option.",
  "frontend/src/components/VideoModal.tsx": "Empty file with no implementation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, reinitializing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks that wrap backend actor calls for profiles, content, store data, training resources, and mutations.",
  "frontend/src/index.css": "Defines Tailwind base layers, CSS variables for light/dark themes, and custom utility classes for glow, shadows, and decorative effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then mounts App with global styles.",
  "frontend/src/utils/staticAssetUrl.ts": "Constructs safe URL‑encoded paths for static assets, handling absolute URLs and cleaning /assets/ prefixes.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters using both query strings and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, shadows, radii, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing current state, known issues, and feature requests related to fixing Training Document #2 PDF linking."
}