{
  "backend/main.mo": "Main backend actor defining data types (UserProfile, Appointment, Product, Order, Video, Publication, etc.), mutable state maps for storing entities, and helper functions including membership access checks.",
  "feature_evidence.json": "Feature evidence report documenting the change of biography section heading from 'About Dr. Charbonnet' to 'A Tidbit About Dr. Shane JC' in Biography.tsx with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including App.tsx (main app with auth and routing), hooks, Header, Footer, Hero, Biography (with updated heading), Booking, Store, and other UI sections.",
  "frontend/BUILD_AND_DRAFT_DEPLOY.md": "Runbook providing concise guide for building the frontend and producing a draft deployment, including prerequisites like Node.js, pnpm, and DFX CLI.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Dr. Shane J Charbonnet Professional Brand Website', root div, and module script loading main.tsx.",
  "frontend/SMOKE_TEST_CHECKLIST.md": "Manual browser smoke test checklist with two main tests: landing page render verification and Internet Identity login initiation, including pass/fail criteria and troubleshooting guidance.",
  "frontend/src/App.tsx": "Main application component with forced light theme, authentication handling, profile setup modal, display name setup screen for paid members, members community routing, payment success/failure routing, and public site sections.",
  "frontend/src/components/Biography.tsx": "Biography section displaying Dr. Charbonnet's graduation portrait with metallic gold shimmer border, bioluminescent depth lighting, parallax backgrounds, and section heading 'A Tidbit About Dr. Shane JC' with Renaissance-styled design elements.",
  "frontend/src/components/Booking.tsx": "Displays a booking section for one-on-one consulting sessions at $515/hour, requiring authentication and membership access. Shows loading state, membership gate with login/membership plan buttons, and optional PayPal payment link for members.",
  "frontend/src/components/CartDrawer.tsx": "Shopping cart drawer component that displays cart items, calculates totals, and handles Stripe checkout session creation. Includes cart management (remove items, clear cart) and validates Stripe configuration before checkout.",
  "frontend/src/components/Contact.tsx": "Contact information section displaying phone, email, and location details fetched from backend. Renders contact info in a card layout with icons for each contact method.",
  "frontend/src/components/Credentials.tsx": "Static credentials section displaying Ph.D. and Master's diploma images with decorative styling. Features gradient backgrounds, glow effects, and amber/yellow color scheme.",
  "frontend/src/components/DisplayNameSetupScreen.tsx": "Full-screen modal for setting user display name (max 25 characters) on first login. Validates input and calls backend mutation to save display name before allowing community access.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty component file with no content.",
  "frontend/src/components/Footer.tsx": "Footer component displaying professional credentials (degrees, certifications, military service, publications) in an olive/orange themed section, plus copyright notice with caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Fixed header with navigation menu, Internet Identity authentication, and responsive mobile menu. Supports two modes: main site navigation (home, about, publications, etc.) or community navigation.",
  "frontend/src/components/Hero.tsx": "Hero section component with parallax mouse-tracking effects, layered background images (celestial, geometric, renaissance overlays), glowing orbs, and a portrait with neural-pattern glow effects. Includes scroll-to-section functionality.",
  "frontend/src/components/Media.tsx": "Media section component that displays training videos with access control based on membership status. Shows locked state with login/subscription prompts for non-members, with PayPal payment integration.",
  "frontend/src/components/MembersCommunity.tsx": "Members-only community page component that checks authentication and membership status, displaying access gates for non-authenticated or non-member users with prompts to log in or subscribe.",
  "frontend/src/components/Membership.tsx": "Membership subscription section that displays available membership plans, features list, and handles PayPal-based subscription flow. Shows active member status and integrates with Stripe configuration checks.",
  "frontend/src/components/PaymentFailure.tsx": "Payment cancellation/failure page component that displays an error state with options to return home or retry the membership purchase.",
  "frontend/src/components/PaymentSuccess.tsx": "Payment success confirmation page that invalidates membership query cache, displays success message, and lists newly unlocked member benefits with navigation options.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to create their profile with required name and email fields, plus optional phone number. Submits profile data via useSaveCallerUserProfile hook and displays toast notifications.",
  "frontend/src/components/Publications.tsx": "Displays Dr. Charbonnet's publications with Amazon purchase links and includes a PayPal payment portal section. Features celestial-themed background styling with amber/gold accent colors.",
  "frontend/src/components/Store.tsx": "Displays hardcoded apparel items with Bonfire purchase links and QR codes in a three-line format (title, order button, QR code). Uses celestial background styling matching the site theme.",
  "frontend/src/components/StripeSetupModal.tsx": "Admin-only modal for configuring Stripe payment settings including secret key and allowed countries. Only renders for admin users and saves configuration via useSetStripeConfiguration hook.",
  "frontend/src/components/SupportDonations.tsx": "Displays Venmo and Cash App donation options in a two-column grid with QR code images and payment handles. Features hover effects with golden glow and decorative corner accents.",
  "frontend/src/components/TrainingVideos.tsx": "Displays training videos and documents with external links, mapping specific document IDs to static PDF assets. Includes PayPal payment portal and uses celestial-themed styling with amber accents.",
  "frontend/src/components/VideoModal.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout flow, identity persistence in local storage, and delegation validity checking.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for all backend data operations including user profiles, display names, biography, appointments, store access, products, publications, shopping cart, training materials, and Stripe configuration.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom design tokens using OKLCH color space, including light/dark theme variables, utility classes for glow effects, shadows, metallic borders, and geometric overlays.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/staticAssetUrl.ts": "Provides a utility function to safely construct URL-encoded paths for static assets, handling spaces and special characters while preserving the /assets/ prefix.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities for sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color system, container settings, border radius variables, and custom shadow/animation utilities.",
  "project_state.json": "Project state file for a members-only portal for Dr. Shane JC with login access control. Tracks one completed feature and one pending request to change a biography section heading from 'About Dr. Charbonnet' to 'A Tidbit About Dr. Shane JC'."
}