{
  "backend/main.mo": "Motoko actor defining data models and in‑memory maps for users, products, appointments, publications, videos, and access control with mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report listing two frontend updates related to Training Document #3 PDF handling and UI link logic, including impacted files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten one‑sentence summaries of major frontend components and hooks across the React app.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, payment status routing, profile setup modal, and rendering all major site sections with a forced light theme.",
  "frontend/src/components/Biography.tsx": "Biography section component fetching biography content and rendering an animated parallax design with portrait, overlays, and styled text.",
  "frontend/src/components/Booking.tsx": "Booking component showing consulting rate details and member-only access gating with login prompts and link to membership plans.",
  "frontend/src/components/CartDrawer.tsx": "Implements a side drawer shopping cart with item listing, total calculation, Stripe checkout handling, and cart management actions.",
  "frontend/src/components/Contact.tsx": "Displays contact information fetched from backend including phone, email, and location within a styled card.",
  "frontend/src/components/Credentials.tsx": "Renders a credentials section showing Ph.D. and Master's diploma images with decorative styling.",
  "frontend/src/components/DnsStatusChecker.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/Footer.tsx": "Provides a footer containing professional credential text and a copyright notice with a link.",
  "frontend/src/components/Header.tsx": "Creates a responsive header with navigation, scroll effects, and authentication controls using Internet Identity.",
  "frontend/src/components/Hero.tsx": "Renders an animated hero section with parallax background layers, glowing effects, and a portrait image.",
  "frontend/src/components/Media.tsx": "Displays a members‑only media section with access checks, parallax visuals, and prompts for login or membership.",
  "frontend/src/components/Membership.tsx": "Displays membership plans, user membership status, and PayPal subscription flow with loading states and animated UI.",
  "frontend/src/components/PaymentFailure.tsx": "Shows a payment cancellation screen with options to return home or scroll back to the membership section.",
  "frontend/src/components/PaymentSuccess.tsx": "Shows a payment success screen, refreshes membership-related queries, and offers navigation back home or to content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal form for creating a user profile, submitting name, email, and optional phone via a saveProfile mutation.",
  "frontend/src/components/Publications.tsx": "Fetches and displays a list of publications with purchase links and a PayPal portal section.",
  "frontend/src/components/Store.tsx": "Shows hardcoded apparel items with Bonfire purchase links and optional QR codes.",
  "frontend/src/components/StripeSetupModal.tsx": "Modal for admins to enter and save Stripe secret key and allowed countries using a mutation hook.",
  "frontend/src/components/SupportDonations.tsx": "Section displaying donation options with styled Venmo and Cash App cards and background effects.",
  "frontend/src/components/TrainingVideos.tsx": "Loads and displays training videos and documents with custom asset handling and PayPal link, showing loaders while fetching.",
  "frontend/src/components/VideoModal.tsx": "Empty placeholder file for a video modal component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity persistence using AuthClient within a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, content, access checks, store data, and training resources via the backend actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, theme CSS variables for light/dark modes, and custom utility classes for glow, shadows, overlays, and decorative effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/staticAssetUrl.ts": "Builds safe URL-encoded asset paths, ensuring /assets/ prefix and handling absolute URLs.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended OKLCH color variables, container settings, and custom shadows and radii.",
  "project_state.json": "Describes project state, known issues, and pending feature requests related to updating Training Document #3 and handling static PDF assets."
}