{
  "kind": "build_request",
  "title": "Fix Training Document #2 link to open the PDF instead of looping back to the site",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make Training Document #2 (the line-2 clickable text/link in the Training Documents section) open the actual PDF document in a new tab, matching the behavior of Training Document #1, instead of navigating back to the website/SPA.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "For line-2, however, when 'selecting' the button -- line-2, it should 9open-up0 the document itself. Instead, it loops back to the website itself! Note, it should work just like as in exactly training doc #1. When selecting the button, the document itself opens-up! This should happen also for training doc#2."
        ]
      },
      "acceptanceCriteria": [
        "In the Training Documents section, clicking Training Document #2 line-2 text opens a PDF file directly (browser PDF viewer) in a new tab/window.",
        "Clicking Training Document #1 line-2 text continues to open its PDF directly (no regression).",
        "Training Document #2 link does not route to the React app (no hash/SPA navigation; no page that looks like the site home)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Training Document #2 `documentUrl` returned by the backend points to a real, publicly served static PDF asset (under the frontend static `/assets/...` path), so that `getStaticAssetUrl(document.documentUrl)` resolves to an actual PDF response (not `index.html`).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When 'selecting' the button -- line-2, it should 9open-up0 the document itself. Instead, it loops back to the website itself!"
        ]
      },
      "acceptanceCriteria": [
        "The static file referenced by Training Document #2 `documentUrl` exists in the frontend public assets and is reachable at the resolved `/assets/...` URL.",
        "Requesting the resolved URL for Training Document #2 returns `Content-Type: application/pdf` (or otherwise opens as a PDF in the browser), not the site HTML shell.",
        "Backend `getTrainingDocuments()` continues to return Training Document #2 title exactly as currently set (\"The Codex of Value: Determining what Truly Matters.\") unless a new PDF filename/path is explicitly provided elsewhere in the project inputs."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose them only).",
    "Do not modify any immutable frontend hook files listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not change the Training Documents two-line layout or typography (line-1 title and line-2 clickable shortDescription) beyond what is required to fix the link behavior.",
    "Do not add new authentication or membership gating for training documents as part of this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}