{
  "kind": "build_request",
  "title": "Switch site background from black/dark to white for improved readability",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Force the site to render in the light theme so the global background is white (not dark/black), regardless of the user’s system theme settings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Unfortunately, the (black) background is too-too hard to read. Instead, make the background (white)."
        ]
      },
      "acceptanceCriteria": [
        "On a device/browser set to dark mode, the app still renders with a light/white background.",
        "The root page background (body/app shell) appears white/light rather than black/dark across all routes (normal, payment success, payment failure, loading state)."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Update any explicitly dark UI surfaces that conflict with the new white background so text remains highly readable, including the Header brand pill/button background and the Hero intro text container background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "the (black) background is too-too hard to read. Instead, make the background (white)."
        ]
      },
      "acceptanceCriteria": [
        "The Header brand area no longer uses a black background that reduces readability against the white/light page (e.g., replace with a light/neutral surface using existing theme tokens).",
        "The Hero intro text block (neon green bordered box) uses a light/white (or very light) fill so the paragraph text is easy to read on the white-themed page.",
        "Text contrast meets a clearly readable standard in the Hero intro block, Header, and other primary copy areas (no dark-on-dark or low-contrast combinations introduced by the theme switch)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only components).",
    "Keep the existing React + Tailwind + Shadcn + React Query stack; no new frameworks or external styling libraries."
  ],
  "nonGoals": [
    "Do not change backend behavior, schemas, or data catalogs.",
    "Do not redesign layout or change content/wording of existing sections beyond what is needed to improve readability under a white background."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}