{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Force light theme and update dark UI surfaces for readability",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Force the app to always render in light theme (white background) regardless of the user’s system theme.",
      "acceptanceCriteria": [
        "On a device/browser set to dark mode, the app still renders with a light/white background.",
        "The root page background (body/app shell) appears white/light rather than black/dark across all routes (normal, payment success, payment failure, loading state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the next-themes ThemeProvider configuration to force the light theme (e.g., forcedTheme=\"light\" and disable system theming) so the app never applies the dark theme classes/variables, including for loading and payment success/failure renders."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Add a small startup safeguard to ensure any persisted/previously-applied dark theme class is removed from the root element before the app renders, ensuring a consistently white/light background on initial load."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Replace explicitly dark UI surfaces (Header brand pill and Hero intro box) with light/neutral fills so text remains highly readable on the white background.",
      "acceptanceCriteria": [
        "The Header brand area no longer uses a black background that reduces readability against the white/light page (e.g., replace with a light/neutral surface using existing theme tokens).",
        "The Hero intro text block (neon green bordered box) uses a light/white (or very light) fill so the paragraph text is easy to read on the white-themed page.",
        "Text contrast meets a clearly readable standard in the Hero intro block, Header, and other primary copy areas (no dark-on-dark or low-contrast combinations introduced by the theme switch)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the Header brand pill/button styling to remove the explicit dark/black background and replace it with a light/neutral surface (e.g., card/background + border + subtle shadow) while preserving the existing layout and hover/scroll behavior."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update the .neon-green-intro-box utility class to use a light/white (or very light) background fill (keeping the neon green border) and ensure foreground text remains high-contrast and readable on the new light theme."
        }
      ]
    }
  ]
}