{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Training Document #2 PDF link to open the static PDF in a new tab",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Training Document #2 line-2 link opens the actual PDF in a new tab (like Training Document #1) and does not navigate within the SPA.",
      "acceptanceCriteria": [
        "In the Training Documents section, clicking Training Document #2 line-2 text opens a PDF file directly (browser PDF viewer) in a new tab/window.",
        "Clicking Training Document #1 line-2 text continues to open its PDF directly (no regression).",
        "Training Document #2 link does not route to the React app (no hash/SPA navigation; no page that looks like the site home)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TrainingVideos.tsx",
          "operation": "modify",
          "description": "Update the Training Documents rendering so Training Document #2 always resolves to a concrete static .pdf under /assets/... (and still uses target=\"_blank\"), preventing SPA navigation when the backend-provided documentUrl is missing/incorrect. Keep the strict two-line layout/typography unchanged and avoid changes to Training Document #1 behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the Training Document #2 documentUrl resolves to a publicly served static PDF under the frontend /assets path so the resolved URL returns a PDF (not index.html).",
      "acceptanceCriteria": [
        "The static file referenced by Training Document #2 `documentUrl` exists in the frontend public assets and is reachable at the resolved `/assets/...` URL.",
        "Requesting the resolved URL for Training Document #2 returns `Content-Type: application/pdf` (or otherwise opens as a PDF in the browser), not the site HTML shell.",
        "Backend `getTrainingDocuments()` continues to return Training Document #2 title exactly as currently set (\"The Codex of Value: Determining what Truly Matters.\") unless a new PDF filename/path is explicitly provided elsewhere in the project inputs."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/training-documents/C3.pdf",
          "operation": "create",
          "description": "Add the static PDF asset that Training Document #2 should open, ensuring it is served as a real PDF from the frontend static assets (so the resolved /assets/... URL does not fall back to the SPA HTML)."
        },
        {
          "path": "frontend/src/utils/staticAssetUrl.ts",
          "operation": "modify",
          "description": "Harden getStaticAssetUrl usage expectations for document links by ensuring it consistently produces an /assets/... URL suitable for direct file responses (PDF) even when filenames include spaces/special characters; keep behavior for absolute URLs unchanged."
        }
      ]
    }
  ]
}