{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 22,
  "summary": "An Internet Computer (ICP) canister-backed professional brand website for Dr. Shane J. Charbonnet, providing a one-page React + Tailwind SPA with Internet Identity auth, member gating, Stripe Checkout (HTTP outcalls) and prominent PayPal payment portal links, plus content sections for publications/books (Amazon links), training videos (YouTube links), and training documents (PDF downloads) with clear \"Training Documents\" separation under Training Videos. The site also includes a soundtrack area with a \"Play Soundtrack\" control and a neon-lime \"Site Soundtrack\" label above three left/center/right YouTube items, and a bottom credentials area showcasing diplomas and related images; ongoing work is constrained by recurring Caffeine credit-sync/lockout and deployment reservation failures.",
  "architectural_notes": [
    "ICP architecture: Motoko canister (backend/main.mo) exposes query/shared methods; frontend creates an authenticated actor using Internet Identity.",
    "Authorization implemented as a reusable Motoko module (authorization/access-control.mo) and included via a mixin (authorization/MixinAuthorization.mo); first initializer with correct secret becomes admin, others become users.",
    "Backend integrates Stripe via IC management canister HTTP outcalls (ic:aaaaa-aa) with a response transform function to strip headers (backend/http-outcalls/outcall.mo, backend/stripe/stripe.mo).",
    "Frontend data-fetching is centralized via TanStack React Query hooks (frontend/src/hooks/useQueries.ts), with an actor lifecycle hook (frontend/src/hooks/useActor.ts) that invalidates/refetches dependent queries on identity changes.",
    "UI is organized as section components in a one-page layout (Hero, Biography, Publications, TrainingVideos, Membership, Booking, Store, Media, Contact, SupportDonations, Credentials) and uses Tailwind with OKLCH theme tokens and custom glow/renaissance-themed animations.",
    "Admin configuration UX: StripeSetupModal is rendered when Stripe is not configured and the caller is admin (checked via useIsCallerAdmin).",
    "Blob-storage mixin exists for integration with Caffeine storage gateway principals and dead-blob pruning flows (backend/blob-storage/Mixin.mo, Storage.mo), though the current UI primarily serves static /assets files.",
    "Project now includes a reusable build-template workspace (React + shadcn/ui + ICP canister scaffolding) with scripts for pruning/resizing images, shared lint rules, and standardized canister/frontend configuration for deployments.",
    "Recent deployments/edits include a 'Play Soundtrack' UI with three horizontally arranged YouTube links (left/center/right) and a separate neon-lime 'Site Soundtrack' label above those links.",
    "Operational dependency: progress is frequently blocked by Caffeine platform credit-accounting lockouts and intermittent deployment failures (e.g., CaLM canister reservation failed), which can prevent planned single-credit updates from executing predictably."
  ],
  "known_issues": [
    "Motoko canister state is held in non-stable variables (Maps/vars are not declared stable); upgrades will reset user profiles, contact submissions, Stripe configuration, appointments, etc.",
    "Environment variable name typos likely break deployment: Storage expects \"CAFFFEINE_STORAGE_CASHIER_PRINCIPAL\" (triple 'F'); authorization expects \"CAFFEINE_ADMIN_TOKEN\". A mismatch will trap at runtime.",
    "Stripe checkout body builder incorrectly sets shipping allowed countries using index [0] for every country, overwriting/duplicating the same parameter key; it should increment the index per country.",
    "URL encoding in Stripe module is simplistic (only replaces space, &, =); it does not fully implement percent-encoding and may break for other characters.",
    "Training document filenames include spaces and a colon (e.g., \"Distinction Codex: ... .pdf\"); the frontend forms URLs as `/assets/${document.documentUrl}` without URI encoding, which can fail depending on hosting/static server behavior.",
    "Frontend membership purchase UX currently redirects to PayPal directly (Membership.tsx) rather than using the implemented canister Stripe membership purchase flow (purchaseMembership hook exists but is not used there).",
    "Membership activation is manual (PaymentSuccess text says admin will activate). Backend has activateMembership but there is no automated webhook/poller tying Stripe session completion to activation.",
    "Some backend structures appear unused or incomplete (e.g., checkoutSessions Map is declared but not used; trainingDocumentIdCounter is unused).",
    "Backend includes member-only product/video/appointment creation endpoints, but the current UI sections for Booking/Media show access gates without implementing booking forms or premium media playback.",
    "Training Documents section intermittently showed unintended/unauthorized PDF entries; needs strict control so only user-provided PDFs are displayed, with correct public vs member-only placement."
  ],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication context",
      "synonyms": [
        "II login",
        "AuthClient provider"
      ],
      "description": "Provides an application-wide React context for Internet Identity authentication, including initialization from local storage, login/logout actions, delegation validity checks, and detailed login status flags.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Per-identity ICP actor creation and caching",
      "synonyms": [
        "useActor",
        "actor lifecycle"
      ],
      "description": "Creates an anonymous or authenticated canister actor based on Internet Identity, caches it via React Query with infinite stale time, initializes access control using a secret parameter, and invalidates/refetches dependent queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Role-based access control (admin/user/guest)",
      "synonyms": [
        "AccessControl",
        "authorization mixin"
      ],
      "description": "Implements user roles and permissions in Motoko; supports initialization with an admin secret (first successful caller becomes admin), querying caller role, admin checks, and admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "User profile storage and retrieval",
      "synonyms": [
        "profile setup",
        "getCallerUserProfile"
      ],
      "description": "Allows registered users to save and retrieve a per-principal profile (name, email, optional phone, membership flag). Admins can retrieve other users’ profiles; access is restricted by role checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Profile setup modal for new authenticated users",
      "synonyms": [
        "ProfileSetupModal",
        "onboarding"
      ],
      "description": "Frontend modal prompts logged-in users without a stored profile to enter required name/email and optional phone, then saves the profile via the backend (defaulting hasMembership to false).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Membership plans and membership status checks",
      "synonyms": [
        "membership system",
        "isUserMember"
      ],
      "description": "Backend exposes fixed monthly/yearly membership plans, supports checking whether the caller is an active member, and provides admin-only membership activation/deactivation which flips the user profile membership flag.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Access gates for member-only areas",
      "synonyms": [
        "checkVideoAccess",
        "checkStoreAccess",
        "checkBookingAccess"
      ],
      "description": "Backend provides boolean access checks for videos/media, store, and booking based on membership; frontend components use these checks to display member-only messaging and calls-to-action.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Stripe configuration management (admin-only)",
      "synonyms": [
        "StripeSetupModal",
        "setStripeConfiguration"
      ],
      "description": "Backend stores Stripe secret key and allowed shipping countries; frontend provides an admin-only modal to configure Stripe when the payment system is not configured.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Stripe Checkout session creation for cart items",
      "synonyms": [
        "createCheckoutSession",
        "Stripe payment redirect"
      ],
      "description": "Backend creates Stripe Checkout sessions via IC HTTP outcalls; frontend CartDrawer converts cart items into ShoppingItem objects and redirects the browser to the Stripe-hosted Checkout URL.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Stripe session status lookup",
      "synonyms": [
        "getStripeSessionStatus"
      ],
      "description": "Backend can query a Stripe Checkout session and extract `client_reference_id` (intended to associate the session to a user principal) returning a completed/failed status variant.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Publications catalog (fixed verified set)",
      "synonyms": [
        "books list",
        "getPublications"
      ],
      "description": "Backend serves a strict, hard-coded set of 5 verified publications with metadata and Amazon links; frontend renders them with sequential numbering and outbound purchase links.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Training videos directory (verified list)",
      "synonyms": [
        "getTrainingVideos",
        "training content links"
      ],
      "description": "Backend serves a verified list of training video entries; frontend displays them with numbering and external watch links.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Training documents directory (verified list)",
      "synonyms": [
        "getTrainingDocuments",
        "PDF downloads"
      ],
      "description": "Backend serves a verified list of training document entries; frontend renders downloadable PDF links from the site’s static assets path.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Public apparel listing (Bonfire links + QR codes)",
      "synonyms": [
        "Apparel store section",
        "merch"
      ],
      "description": "Frontend Store section shows three apparel items in a consistent three-line layout (title, order button linking to Bonfire, QR code image). Backend also exposes a verified apparel API endpoint.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Shopping cart drawer UI",
      "synonyms": [
        "CartDrawer",
        "cart sidebar"
      ],
      "description": "Provides a slide-in cart drawer with item list, remove/clear actions, total calculation, and a checkout button that initiates Stripe checkout when configured.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Payment success/failure routing via URL params",
      "synonyms": [
        "PaymentSuccess",
        "PaymentFailure"
      ],
      "description": "Frontend detects `?payment=success` or `?payment=cancelled`, shows dedicated success/failure pages, clears the URL, and invalidates relevant queries (membership and profile) on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Contact info display",
      "synonyms": [
        "getContactInfo",
        "contact section"
      ],
      "description": "Backend returns static phone/email/location; frontend displays this information in a card UI with tel/mailto links.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Contact form submission storage (backend)",
      "synonyms": [
        "submitContactForm",
        "contact submissions"
      ],
      "description": "Backend supports public submission of contact messages and admin-only retrieval of stored contact submissions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Appointment booking API (members-only)",
      "synonyms": [
        "bookAppointment",
        "appointments admin list"
      ],
      "description": "Backend supports member-only appointment booking with session type and time, plus admin-only retrieval of all appointments.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Credentials media section",
      "synonyms": [
        "diplomas gallery"
      ],
      "description": "Frontend displays Ph.D. diploma, Master’s diploma, and a portrait image with consistent themed styling; backend also exposes a credentials record with the expected filenames.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Support & donations section (Venmo/Cash App)",
      "synonyms": [
        "donations",
        "support"
      ],
      "description": "Frontend provides donation/support cards linking to Venmo and Cash App with embedded QR images and responsive layout.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Theme and design system (Tailwind + OKLCH tokens)",
      "synonyms": [
        "22nd-century Renaissance theme",
        "glow animations"
      ],
      "description": "Centralized Tailwind theme configuration and global CSS define OKLCH color tokens, glow/neon/copper accents, and reusable animation utilities for the site’s visual identity.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Blob storage gateway authorization and dead-blob management (backend)",
      "synonyms": [
        "caffeine storage mixin",
        "dead blob pruning"
      ],
      "description": "Includes a storage mixin that can sync authorized gateway principals, expose dead blobs for deletion, confirm deletion, and trigger GC; includes a cashier refill flow guarded by an environment-configured principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Video modal UI for in-page media playback",
      "synonyms": [
        "VideoModal",
        "training video modal"
      ],
      "description": "Frontend includes a VideoModal component used to present video/media content in an in-page modal dialog experience rather than navigating away, enabling a consistent themed playback/viewing UX.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "DNS status checker utility component",
      "synonyms": [
        "DnsStatusChecker",
        "custom domain status"
      ],
      "description": "Frontend includes a DnsStatusChecker component to help verify/communicate DNS configuration status for the deployed site (e.g., when using custom domains), providing a lightweight diagnostics/status UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-add-an-intro-audio-player-to-the-top-of-the-homepage-within-the-existing-hero-section-positioned-directly-under-the-large-portrait-image-and-directly-above-the-simply-shane-designs-c-sm-presents-headings",
      "title": "Add an intro audio player to the top of the homepage within the existing Hero section, positioned directly under the large portrait image and directly above the “Simply Shane Designs (c)sm” / “-- PRESENTS --” headings.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-store-the-uploaded-audio-file-as-a-frontend-static-asset-and-wire-the-hero-audio-player-to-that-exact-file-use-the-original-uploaded-filename-do-not-add-placeholder-or-sample-media",
      "title": "Store the uploaded audio file as a frontend static asset and wire the Hero audio player to that exact file (use the original uploaded filename; do not add placeholder or sample media).",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add/maintain Play Soundtrack section with three horizontally aligned YouTube soundtrack links and a neon-lime \"Site Soundtrack\" label above them",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Implement Training Documents section under Training Videos: allow public PDFs (first ~3) and member-only PDFs gated behind paid membership/consulting access",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Ensure Apparel section supports consistent per-item 3-line layout (name, order link/button, QR-code image) and add additional apparel items over time",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Complete payment portal UX across paywalled areas: display PayPal payment portal info consistently (and later Stripe) wherever membership/purchases are required",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Training section docs UX: add/maintain a distinct \"Training Documents\" header below Training Videos with spacing; support adding PDFs one-by-one (title + Download PDF) with first ~3 public and remaining member-only; ensure no placeholder/unauthorized PDFs appear",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Payments UX: add PayPal Payment Portal (label/button/link formatting) wherever payment is required (membership, apparel/store, booking, members-only), with Stripe to be configured/activated later",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-7",
      "summary": "Training Documents enhancements: add distinct \"Training Documents\" header/banner and spacing below Training Videos; support adding public PDFs one-by-one with title + Download PDF button, and keep remaining PDFs member-only",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-8",
      "summary": "Credentials and education presentation updates: ensure bottom-page credentials area shows diplomas/portrait in the specified layout; update Education section lines to reflect degrees and postgrad studies accurately",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-9",
      "summary": "Soundtrack UX refinement: keep 3-column left/center/right soundtrack items under Play Soundtrack with neon-lime \"Site Soundtrack\" label above; allow swapping the left item/link while keeping center/right unchanged",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-10",
      "summary": "Add a new public Training Document entry as Training Document #3 directly beneath the existing Training Document #2 (no reordering of existing documents). The new document must use this exact two-line content: Line 1 (title): “Transforming Adversity into Lasting Professional and Personal Maturity.” Line 2: “The attached PDF file (11,939 KB)”.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-11",
      "summary": "Ensure the new Training Document #3 uses the uploaded PDF file only and is publicly downloadable from the Training Documents section. Add the PDF to the frontend static assets and reference it from the backend training documents catalog so the existing download behavior works reliably.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-12",
      "summary": "Add a short site introduction media at the very top of the homepage: place an intro video (or audio-to-video-style embed) directly under the large portrait photo and directly above the “Simply Shane Designs (c)sm -- PRESENTS --” line",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Dr. Shane J Charbonnet Professional Brand Website",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}